---
kind: type
id: T:Autodesk.Revit.DB.VertexIndexPairArrayIterator
source: html/e490a9ba-4c2b-7113-f118-4e1299ffe5c6.htm
---
# Autodesk.Revit.DB.VertexIndexPairArrayIterator

An iterator to an array of VertexIndex pairs.

## Syntax (C#)
```csharp
public abstract class VertexIndexPairArrayIterator : APIObject,
	IEnumerator
```